package com.integrate.enums;

/**
 */
public enum SysMsgEnumType implements IMsgEnumType {
    SUCCESS(0, ""),


    VERIFY_LACK(1, ""),

    MD5_LACK(2, "请求的参数不符合加密要求."),

    MD5_UNCHECK(3, "此接口需要加密效检！"),

    INVALID_REQUEST(4, "非法请求"),

    CDN_PARAM_LACK(5, "cdn参数有误"),

    LOGIN_PARAM_LACK(6, "此接口需要登陆效检！"),

    MD5_MUST_CHECK(7, ""),

    TIME_CHECK(8, ""),  //预留错误码，处理接口请求时间不准

    PARAM_CONVERT_ERROR(9, "转换参数失败"),

    VERIFY_ERROR(10, "校验Token失败！"),

    /***************************************************************************************************************/




    SYSTEM_UPGRADE(91, "哎呀，服务器维护升级中，等会儿再试吧"),

    UPGRADE_APP(99, "升级到最新版才可以用哦"),

    SERVICE_BUSY(100, "哎呀，服务器偷懒啦，等会儿再试吧"),
    /* 封号*/
    BLACK_PLAYER(101, ""),

    /***************************************************************************************************************/



    /******************* 1000-1999  参数不合法、少传等. 客户端润色文案*************************************************/

    FAIL(1001, "操作失败"),

    PARAM_LACK(1002, "业务请求参数错误"),

    PARAM_BLANK(1003, "业务请求参数部分为空"),

    REGISTER_FREQUENT(1004, "亲，服务器偷懒啦，等会儿再试吧"),

    /***************************************************************************************************************/



    /******************* 2000-8999 业务控制返回错误. 弹服务器文案*****************************************************/

    // 具体业务错误码请写在 MsgEnumType 类中!!!
    // 具体业务错误码请写在 MsgEnumType 类中!!!
    // 具体业务错误码请写在 MsgEnumType 类中!!!
    LOGIN_FAIL(2000,"用户名或密码错误"),
    RESET_PWD(2001,"重置密码失败"),
    TRADEPWD_FAIL(2002,"交易密码错误"),
    EXCAHNGE_FAIL(2003,"兑换失败"),
    INTEGRATE_FAIL(2004,"积分不足"),
    TRADE_FAIL(2005,"交易失败"),
    FREEZE_FAIL(2006,"系统维护中，请稍后再试"),
    WITHDRAW_FAIL(2007,"提现的金额只能为100的整数倍，最少100起"),
    /**********************************************************************************************************/



    /******************* 9000-9999 服务器端代码异常. 客户端润色文案************************************************/

    SYSTEM_ERROR(9000, "系统错误"),
    XML_PARSE_ERROR(9001, "解析失败"),

    /***********************************************************************************************************/



    /******************* 负数 服务器端系统异常. 客户端润色文案****************************************************/


    /**********************************************************************************************************/

    ;

    SysMsgEnumType(int code, String message) {
        this.code = code;
        this.message = message;
    }

    private int code;
    private String message;

    @Override
    public int getCode() {
        return code;
    }

    @Override
    public String getMessage() {
        return message;
    }

    @Override
    public String getProject() {
        // TODO Auto-generated method stub
        return null;
    }

}


